In [2]:
import pandas as pd
  
# Define a dictionary containing employee data
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj', 'Geeku'],
        'Age':[27, 24, 22, 32, 15],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj', 'Noida'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd', '10th']}
 
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data)
 
# select all columns
df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd
4   Geeku   15      Noida          10th

## df.sample()-->returns random sample of items from an axis

#### Select rows from Pandas DataFrame Using sample() method

In [3]:
df.sample()

     Name  Age Address Qualification
1  Princi   24  Kanpur            MA

#### Randomly Select Rows Using parameter n

In [4]:
df.sample(n=4)

     Name  Age    Address Qualification
1  Princi   24     Kanpur            MA
0     Jai   27      Delhi           Msc
3    Anuj   32    Kannauj           Phd
2  Gaurav   22  Allahabad           MCA

#### Randomly Select Rows Using frac Parameter

In [5]:
df.sample(frac=.5)

     Name  Age  Address Qualification
3    Anuj   32  Kannauj           Phd
1  Princi   24   Kanpur            MA

#### First selects 70% rows of whole df dataframe and put in another dataframe df1 after that we select 50% frac from df1.

In [7]:
data=df.sample(frac=.7)
data

     Name  Age    Address Qualification
3    Anuj   32    Kannauj           Phd
4   Geeku   15      Noida          10th
2  Gaurav   22  Allahabad           MCA
1  Princi   24     Kanpur            MA

In [8]:
data.sample(frac=.5)

    Name  Age  Address Qualification
4  Geeku   15    Noida          10th
3   Anuj   32  Kannauj           Phd

#### Select Rows Randomly with replace = false

In [9]:
df.sample(n=3,replace=False)

     Name  Age    Address Qualification
2  Gaurav   22  Allahabad           MCA
1  Princi   24     Kanpur            MA
0     Jai   27      Delhi           Msc

In [10]:
df.sample(n=3,replace=True)

     Name  Age Address Qualification
4   Geeku   15   Noida          10th
1  Princi   24  Kanpur            MA
4   Geeku   15   Noida          10th

#### Randomly Select columns from Pandas DataFrame Using axis

In [14]:
df.sample(axis=1,n=2)

  Qualification    Address
0           Msc      Delhi
1            MA     Kanpur
2           MCA  Allahabad
3           Phd    Kannauj
4          10th      Noida

#### Randomly Select Rows from Pandas DataFrame Using random_state

In [17]:
df.sample(n=2,random_state=0)

     Name  Age    Address Qualification
2  Gaurav   22  Allahabad           MCA
0     Jai   27      Delhi           Msc